[基本设置]
开机自启=0
管理员启动=1
自动切换=1
默认输入法=2
切换提示=0
切换提示时间=4000
切换提示文字大小=20
切换提示透明度=235,180
切换提示偏移=0,0
切换提示固定位置=50,30
托盘图标显示=1
托盘图标双击=2
托盘图标显示输入法=1
托盘图标样式=原版
鼠标指针显示输入法=0
鼠标指针样式=
鼠标指针对应分辨率=0
[热键屏蔽窗口列表]
pythonw=ahk_exe pythonw.exe
Code=ahk_exe Code.exe
thonny=ahk_exe thonny.exe
gvim=ahk_exe gvim.exe
TIM=ahk_exe TIM.exe
[切换屏蔽窗口列表]
[切换提示屏蔽窗口列表]
窗口切换=ahk_class MultitaskingViewFrame
dota2=ahk_exe dota2.exe
TC主页面=ahk_class TTOTAL_CMD
[二次切换屏蔽窗口列表]
TC新建文件夹=ahk_class TCOMBOINPUT
TC搜索=ahk_class TFindFile
TC快搜=ahk_class TQUICKSEARCH
[焦点控件切换窗口列表]
Xshell=ahk_exe Xshell.exe
Steam=ahk_exe Steam.exe
YoudaoDict=ahk_exe YoudaoDict.exe
WeChat=ahk_exe WeChat.exe
[热键设置]
添加至中文窗口=^F11
添加至英文(中文)窗口=^F10
添加至英文输入法窗口=
移除从中英文窗口=
切换中文=
切换英文(中文)=
切换英文输入法=
切换中英文(中文)=
切换中英文输入法=
显示当前输入法=
重置当前输入法=
停止自动切换=
获取输入法IME代码=
[特殊热键]
左Shift=0
右Shift=0
左Ctrl=0
右Ctrl=0
左Alt=0
右Alt=0
[高级设置]
内部关联=..\RunAny\RunAnyConfig.ini
快捷键兼容=1
左键点击输入位置显示输入法状态=1|全局窗口
左键弹起后提示输入法状态生效窗口=Code.exe
定时重置输入法=60|编辑器
切换重置大小写=1|不重置大小写组
上屏字符内容=2|1
提示颜色=333434|dfe3e3|02ecfb|ff0000
托盘提示内容=KBLAutoSwitch（%权限%）`n%启动时间%`n启动时长：%启动时长%`n版本：%版本%`n最新版本：%最新版本%`n自动切换统计：%自动切换次数%
自动检查更新=30
[自定义窗口组]
1=全局窗口=0=AllGlobalWin=全局窗口组
2=编辑器=2=sublime_text.exe|Code.exe|pycharm64.exe|AutoAHK.exe|Notepad2.exe|gvim.exe|AHKEditor.exe=编辑器窗口组
3=不重置大小写组=1=RunAny_SearchBar ahk_exe RunAny.exe=切换窗口不重置大小写
4=资源管理器=2=TOTALCMD.exe|TotalCMD64.exe|ahk_class CabinetWClass ahk_exe explorer.exe=TC、Win文件资源管理器
5=vim=0=gvim.exe=命令模式切换英文
6=浏览器=0=ahk_exe 360ChromeX.exe|ahk_exe chrome.exe=浏览器配合sfk插件
[自定义操作]
1=0=s-; |# =1=ahk、py注释切换中文
2=2=k-~Esc=6=Esc切换英文
3=4=k-~F2|~F7|~^s|~^+n=1=TC切换中文
4=0=k-~Enter|~Esc=6=TC回车或ESC重置输入法
5=5=k-~:=2=
6=6=k-~$\=1=\就是进入输入框
[中文窗口]
win搜索栏=ahk_exe SearchApp.exe
skfp=ahk_exe skfp.exe
TIM=ahk_exe TIM.exe
et=ahk_exe et.exe
vivaldi=ahk_exe vivaldi.exe
tes=首发
[英文窗口]
win桌面=ahk_class WorkerW ahk_exe explorer.exe
win桌面=ahk_class Progman ahk_exe explorer.exe
文件资源管理器=ahk_class CabinetWClass ahk_exe explorer.exe
cmd=ahk_exe cmd.exe
任务管理器=ahk_exe taskmgr.exe
DocBox=ahk_exe DocBox.exe
mintty=ahk_exe mintty.exe
ConEmu64=ahk_exe ConEmu64.exe
dev=Chrome_RenderWidgetHostHWND
PDFXEdit=ahk_exe PDFXEdit.exe
lis=ahk_exe Listary.exe
sz=Windows.UI.Core.CoreWindow
TOTALCMD=ahk_exe TOTALCMD.EXE
thonny=ahk_exe thonny.exe
pycharm64=ahk_exe pycharm64.exe
webstorm64=ahk_exe webstorm64.exe
dnf=ahk_class 地下城与勇士
PDFXCview=ahk_exe PDFXCview.exe
mpv=ahk_exe mpv.exe
chrome=ahk_exe chrome.exe
SciTE=ahk_exe SciTE.exe
[英文输入法窗口]
[信息变量]
最近检查更新日期=2022-10-17 19:39:08
